app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."category" = ? AND "questions"."method" = ?  [["category", "control flow"], ["method", "multiple choice"]]
SELECT "questions".* FROM "questions"
---
  def index
    # Retrieve query parameters
    category = params[:category]
    method = params[:method]

    # Fetch questions based on the query parameters
    questions = if category.present? && method.present?
                  Question.where(category: category, method: method)
                else
                  Question.all